# 4.4 데이터프레임의 데이터 조작

판다스는 넘파이 2차원 배열에서 가능한 대부분의 데이터 처리가 가능하며 추가로 데이터 처리 및 변환을 위한 다양한 함수와 메서드를 제공한다.

## 데이터 갯수 세기

```{margin}
`count`
```

가장 간단한 데이터 분석은 데이터의 갯수를 세는 것이다. `count` 메서드를 사용한다. NaN 값은 세지 않는다.

In [4]:
import numpy as np
import pandas as pd
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [5]:
s.count()

9

데이터프레임에서는 각 열마다 별도로 데이터 갯수를 센다. 데이터에서 값이 누락된 부분을 찾을 때 유용하다.

In [6]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [7]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

다음 명령으로 타이타닉호의 승객 데이터를 데이터프레임으로 읽어올 수 있다. 이 명령을 실행하려면 seaborn 패키지가 설치되어 있어야 한다.

In [8]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

````{admonition} 연습 문제 4.4.1

타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
````

## 카테고리 값 세기

```{margin}
`value_counts`
```

시리즈의 값이 정수, 문자열, 카테고리 값인 경우에는 `value_counts` 메서드로 각각의 값이 나온 횟수를 셀 수 있다.

In [9]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

90    3
91    0
92    0
93    5
94    5
95    4
96    5
97    2
98    4
99    3
dtype: int32

In [10]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

데이터프레임에는 `value_counts` 메서드가 없으므로 각 열마다 별도로 적용해야 한다.

In [11]:
df[0].value_counts()

3.0    2
4.0    1
0.0    1
Name: 0, dtype: int64

## 정렬

```{margin}
`sort_index`
```

```{margin}
`sort_values`
```

데이터를 정렬하려면 `sort_index` 메서드 `sort_values` 메서드를 사용한다. `sort_index` 메서드는 인덱스 값을 기준으로, `sort_values` 메서드는 데이터 값을 기준으로 정렬한다.

앞에서 `s2` 시리즈의 각 데이터 값에 따른 데이터 갯수를 인덱스에 따라 정렬하려면 다음처럼 `sort_index`를 적용한다.

In [13]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

NaN값이 있는 경우에는 정렬하면 NaN값이 가장 나중으로 간다.

In [14]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

큰 수에서 작은 수로 반대 방향 정렬하려면 `ascending=False` 인수를 지정한다.

In [15]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

데이터프레임에서 `sort_values` 메서드를 사용하려면 `by` 인수로 정렬 기준이 되는 열을 지정해 주어야 한다.

In [16]:
df.sort_values(by=1)

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

`by` 인수에 리스트 값을 넣으면 이 순서대로 정렬 기준의 우선 순위가 된다. 즉, 리스트의 첫번째 열을 기준으로 정렬한 후 동일한 값이 나오면 그 다음 열로 순서를 따지게 된다.

In [17]:
df.sort_values(by=[1, 2])

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

````{admonition} 연습 문제 4.4.2

`sort_values` 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.
````

## 행/열 합계

```{margin}
`sum`
```

행과 열의 합계를 구할 때는 `sum(axis)` 메서드를 사용한다. `axis` 인수에는 합계로 인해 없어지는 방향축(0=행, 1=열)을 지정한다.

In [18]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2
df2.to_csv("aa.csv")

행방향 합계를 구할 때는 `sum(axis=1)` 메서드를 사용한다.

In [19]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [16]:
df2["RowSum"] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

열 합계를 구할 때는 `sum(axis=0)` 메서드를 사용하는데 `axis`인수의 디폴트 값이 0이므로 `axis`인수를 생략할 수 있다.

In [20]:
df2.sum()

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [18]:
df2.loc["ColTotal", :] = df2.sum()
df2

             0     1     2     3     4     5    6     7  RowSum
0          5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0    35.0
1          6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0    34.0
2          4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0    41.0
3          9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0    42.0
ColTotal  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0   152.0

```{margin}
`mean`
```

`mean` 메서드는 평균을 구하며 `sum` 메서드와 사용법이 같다.

````{admonition} 연습 문제 4.4.3

1. 타이타닉호 승객의 평균 나이를 구하라.
1. 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
1. 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
````

## `apply` 변환

행이나 열 단위로 더 복잡한 처리를 하고 싶을 때는 `apply` 메서드를 사용한다. 인수로 행 또는 열을 받는 함수를 `apply` 메서드의 인수로 넣으면 각 열(또는 행)을 반복하여 그 함수에 적용시킨다.

In [21]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

예를 들어 각 열의 최대값과 최소값의 차이를 구하고 싶으면 다음과 같은 람다 함수를 넣는다.

In [24]:
df3.apply(lambda x: x.max() - x.min(), axis=0)

A    3
B    2
C    4
dtype: int64

만약 행에 대해 적용하고 싶으면 `axis=1` 인수를 쓴다.

In [25]:
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

각 열에 대해 어떤 값이 얼마나 사용되었는지 알고 싶다면 `value_counts` 함수를 넣으면 된다.

In [26]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

다음과 같이 타이타닉호의 승객 중 나이 20살을 기준으로 성인(adult)과 미성년자(child)를 구별하는 라벨 열을 만들 수 있다.

In [23]:
titanic["adult/child"] = titanic.apply(lambda r: "adult" if r.age >= 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

````{admonition} 연습 문제 4.4.4

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 `category1` 열을 만들어라. `category1` 카테고리는 다음과 같이 정의된다.

1. 20살이 넘으면 성별을 그대로 사용한다.
2. 20살 미만이면 성별에 관계없이 "child"라고 한다.

````

## `fillna` 메서드

NaN 값은 `fillna` 메서드를 사용하여 원하는 값으로 바꿀 수 있다.

In [27]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

````{admonition} 연습 문제 4.4.5

타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

````

## `astype` 메서드

`astype` 메서드로 전체 데이터의 자료형을 바꾸는 것도 가능하다.

In [28]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

````{admonition} 연습 문제 4.4.6

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 `category2` 열을 만들어라. `category2` 카테고리는 다음과 같이 정의된다.

1. 성별을 나타내는 문자열 `male` 또는 `female`로 시작한다.
2. 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.
3. 예를 들어 27살 남성은 `male27` 값이 된다.

````

## 실수 값을 카테고리 값으로 변환

실수 값을 크기 기준으로 하여 카테고리 값으로 변환하고 싶을 때는 다음과 같은 명령을 사용한다.

* `cut`: 실수 값의 경계선을 지정하는 경우
* `qcut`: 갯수가 똑같은 구간으로 나누는 경우

예를 들어 다음과 같은 나이 데이터가 있다고 하자.

In [30]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

`cut` 명령을 사용하면 실수값을 다음처럼 카테고리 값으로 바꿀 수 있다. `bins` 인수는 카테고리를 나누는 기준값이 된다. 영역을 넘는 값은 NaN으로 처리된다.

In [33]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
print(cats)

[NaN, 미성년자, 미성년자, 청년, 청년, ..., 장년, 미성년자, 중년, 중년, NaN]
Length: 12
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

`cut` 명령이 반환하는 값은 `Categorical` 클래스 객체이다. 이 객체는 `categories` 속성으로 라벨 문자열을,  `codes` 속성으로 정수로 인코딩한 카테고리 값을 가진다.

In [37]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [38]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [39]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [40]:
df4 = pd.DataFrame(ages, columns=["ages"])
df4["age_cat"] = pd.cut(df4.ages, bins, labels=labels)
df4

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20    미성년자
9     41      중년
10    32      중년
11   101     NaN

따라서 위 데이터프레임의 age_cat 열값은 문자열이 아니다. 이를 문자열로 만들려면 `astype` 메서드를 사용해야 한다.

In [41]:
df4.age_cat.astype(str) + df4.ages.astype(str)

0       nan0
1      미성년자2
2     미성년자10
3       청년21
4       청년23
5       중년37
6       중년31
7       장년61
8     미성년자20
9       중년41
10      중년32
11    nan101
dtype: object

`qcut` 명령은 구간 경계선을 지정하지 않고 데이터 갯수가 같도록 지정한 수의 구간으로 나눈다. 예를 들어 다음 코드는 1000개의 데이터를 4개의 구간으로 나누는데 각 구간은 250개씩의 데이터를 가진다.

In [53]:
data = np.random.randint(1000, size=(1000,))
print(data)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

[746 909 972  81 874 815 104 427 587 574  25 409 106 456 682 829 300 812
 437 672 924 901 788 829   7 255 612 435 225 690 487 880 467 533 265  77
 139 741 963  35 754 377 498 421  41 137 655 733 375 341  76 797 436  25
  86 165 875 399 918 603 676 173 194   3 186 351  72 968 611 757 502  89
 912 490 341 970 160 958 902 585 805 130 813 781 169 801 259 900 158 961
 709 344 623 586 676 505 833 440 461 710 272 426 621 481 953 733 517 857
 125 855 764 541  95 362 709  86 232 681 721  51 302 570 935  83 655  75
 605 620 746 477 376 820 373 253 568  25 719  36 260 338 496 862 139 298
 790 505 468 796 696 242 416 442 631 342 452 962  22 130 201 129  33 720
 519  63 325 773 741 938 399  35 558 721 791 788 132 279 409 302 799  25
 628 146  11 119  53 813 646 660 517 323 231 395 940 940 502 794 499 725
 568 876 464 949 868 549 302 907 832 995  56 467 790 312 844 970 199 548
 434  31 791 284 768 167 829 928 834 122 314 558 463 877 677 437 602 472
  33 802 537 334  19 237 467 504 436 203 340 613 499 959 224  79 639 482
 297 422  39   6 612   8 256  87 938 914 300 427 861 101 389 130 446 932
 862 637 187 339 915 279 252 414 657 354 679 567 279 784 393 859  30 688
 689  37  51 661 384 671  93 658 295 556 561 940 535 292 337 253 857  69
 363 970 597 580 500  61  43 686 109 949 714 524 675 785 651 260 983 282
 961 784 971 869 893 378 409 831 377 152 912 207 233 212  56 787 877 246
 879 673 577 632 541 294 211 693  69 347 320 915  54 104 715 837 198 244
 733 867 278 337 924 737 201 569 178 660 413 495 505 288 171 987 943 430
 629 878 441 335 257 631  12 679 787 951 626 443 501 883 313 194  88 253
 825 181 373 695 893   2  33 428  53 421 750 702 201 316 581 378 456 342
 466 268 176 392 467 960 794  52 913  27 426 944 376 309  92 614 245 142
 852 557 412 399 289 345 326 654 242 730 748 463 833 525 487 922 307 535
 477 650 328 239 617 435  29 915 514 676 406 312 354 990 186 533 290 613
 935 950 412 395 878  59 514 511 643 854 522 539 129  61 966 235 396 158
 195 207 493 701 697 126 903 170 131 309 217 396 611 498 202 843 886 997
 955 375 930 837 306 481 220 277 469 367 587 171 259  84 262 118 385 321
  96 402 437 519 624 326 942 235 612 537 492 624 674 763 311 711 880 191
 990 395 140 561  79 451 254 438  69 977 425 671 210 673 713 649 728 488
 458 351 615   1 275 267 840 425 279 234  35  58 797 142 742 769 817 862
 679 497 923 825 787 288 267 111 947 983 469 960 460 700 631 392 295  84
 870  97 658 259 430 168  31 479 938 830 535 912 216 543 481  75 339 619
 774  18  45  64 309 213 171 368 633 818 938 621 653 903 896 901 762 909
 776 550 194 955 630 993 371 622 578 261 616 409 216 518 271 586 443 493
 915 946  22 898 490 971 743 753 971 946  41 776 175 723 539 393 326 914
 334 453 883 445 723  35 547 824 821 534 397 176 149 775 113 890 127 895
 390 845 412  43 468 454 761 993 284 457 217 518 437 909 511 840 105 950
  89 818 688 678 185 418 708 961 563 280 998 999 251  85 506 687 625 294
 468 166 415 334 846 904 420 607 584 293 205 122 290  39 147 451 415 326
 448 311 955 312 282 236 985  77 158 615 180 344  31 595 488 171 128  51
 778 840 423 104 972 525  69 453 561 523 140 187 485 397 505 345 671 403
 921 448  86 578 786  86 475 739 255 482 994  36 560 526 168 301 462 703
 896 438 754 532 106 340 279 237 115  55 187 296 805 770 236 497 418 581
 171 474 936 467 500 444 557 402 879 964 282 700 301 570 629 791 641 168
 628 141 973 446  51 478 303 189 825 704 993  23 625   1 898 872 835 253
 467 620 132   8 461 364 782 397 866 120 774 612 479 890 107 452 353 371
  86 612 895 114 924 329 546 467  58 304 265 910 671 748 408 123 664 534
 202 281 787 864 254  74 701 469 135 309 249 856 829 715 964 657 630 683
  28 657 564 688 347 478 111 571 277  86 247 199 476 521 522 404 211 143
 430 806 147 510 828 134 407 885 287 475 128 502 234  83 378 122 583 749
 777 579 577 894 770 500 874 961 431 368 742 245 854 281 403 509 900 436
 582 772 662 361 446  59 680 965 996 879 241 710 279 972 116 543 611 355
 740  58 155 584 798 914  56 172 932 187  88 877 696 747 356 467 824   1
  48 264 950 117 535 362 221 309 326 663]

[Q4, Q4, Q4, Q1, Q4, ..., Q2, Q1, Q2, Q2, Q3]
Length: 1000
Categories (4, object): [Q1 < Q2 < Q3 < Q4]

In [54]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64

````{admonition} 연습 문제 4.4.7

타이타닉호 승객을 '미성년자', '청년', '중년', '장년', '노년' 나이 그룹으로 나눈다.

```
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
```

그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.
````

````{admonition} 연습 문제 4.4.8

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 `category3` 열을 만들어라. `category3` 카테고리는 다음과 같이 정의된다.

1. 20살 미만이면 성별에 관계없이 "미성년자"라고 한다.
2. 20살 이상이면 나이에 따라 "청년", "중년", "장년", "노년"을 구분하고 그 뒤에 성별을 나타내는 "남성", "여성"을 붙인다.

````